Masmiseim36/nxpSDK/boards/evkmimxrt1020_om13790host/project_template/pin_mux.h
/* GPIO_SD_B0_05 (number 42), SD1_D1/J15[8] */
#define BOARD_INITUSDHC_SD1_D1_PERIPHERAL                                 USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHC_SD1_D1_SIGNAL                                 usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHC_SD1_D1_CHANNEL                                        1U   /*!< USDHC1 usdhc_data channel: 1 */
#define BOARD_INITUSDHC_SD1_D1_PIN_NAME                            GPIO_SD_B0_05   /*!< Pin name */
#define BOARD_INITUSDHC_SD1_D1_LABEL                             "SD1_D1/J15[8]"   /*!< Label */
#define BOARD_INITUSDHC_SD1_D1_NAME                                     "SD1_D1"   /*!< Identifier name */

/* GPIO_SD_B0_00 (number 48), SD1_D2/J15[1] */
#define BOARD_INITUSDHC_SD1_D2_PERIPHERAL                                 USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHC_SD1_D2_SIGNAL                                 usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHC_SD1_D2_CHANNEL                                        2U   /*!< USDHC1 usdhc_data channel: 2 */
#define BOARD_INITUSDHC_SD1_D2_PIN_NAME                            GPIO_SD_B0_00   /*!< Pin name */
#define BOARD_INITUSDHC_SD1_D2_LABEL                             "SD1_D2/J15[1]"   /*!< Label */
#define BOARD_INITUSDHC_SD1_D2_NAME                                     "SD1_D2"   /*!< Identifier name */

/* GPIO_SD_B0_01 (number 47), SD1_D3/J15[2] */
#define BOARD_INITUSDHC_SD1_D3_PERIPHERAL                                 USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHC_SD1_D3_SIGNAL                                 usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHC_SD1_D3_CHANNEL                                        3U   /*!< USDHC1 usdhc_data channel: 3 */
#define BOARD_INITUSDHC_SD1_D3_PIN_NAME                            GPIO_SD_B0_01   /*!< Pin name */
#define BOARD_INITUSDHC_SD1_D3_LABEL                             "SD1_D3/J15[2]"   /*!< Label */
#define BOARD_INITUSDHC_SD1_D3_NAME                                     "SD1_D3"   /*!< Identifier name */

/* GPIO_SD_B0_06 (number 41), SD_CD_SW/J15[9] */
#define BOARD_INITUSDHC_SD_CD_SW_GPIO                                      GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITUSDHC_SD_CD_SW_PORT                                      GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITUSDHC_SD_CD_SW_GPIO_PIN                                    19U   /*!< GPIO3 pin index: 19 */
#define BOARD_INITUSDHC_SD_CD_SW_PIN_NAME                          GPIO_SD_B0_06   /*!< Pin name */
#define BOARD_INITUSDHC_SD_CD_SW_LABEL                         "SD_CD_SW/J15[9]"   /*!< Label */
#define BOARD_INITUSDHC_SD_CD_SW_NAME                                 "SD_CD_SW"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHC(void);

/* GPIO_SD_B1_07 (number 24), FlexSPI_CLK/U13[6] */
#define BOARD_INITQSPI_FlexSPI_CLK_PERIPHERAL                            FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPI_FlexSPI_CLK_SIGNAL                         FLEXSPI_A_SCLK   /*!< FLEXSPI signal: FLEXSPI_A_SCLK */
#define BOARD_INITQSPI_FlexSPI_CLK_PIN_NAME                        GPIO_SD_B1_07   /*!< Pin name */
#define BOARD_INITQSPI_FlexSPI_CLK_LABEL                    "FlexSPI_CLK/U13[6]"   /*!< Label */
#define BOARD_INITQSPI_FlexSPI_CLK_NAME                            "FlexSPI_CLK"   /*!< Identifier name */

/* GPIO_SD_B1_08 (number 23), FlexSPI_D0_A/U13[5] */
#define BOARD_INITQSPI_FlexSPI_D0_A_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPI_FlexSPI_D0_A_SIGNAL                       FLEXSPI_A_DATA0   /*!< FLEXSPI signal: FLEXSPI_A_DATA0 */
#define BOARD_INITQSPI_FlexSPI_D0_A_PIN_NAME                       GPIO_SD_B1_08   /*!< Pin name */
#define BOARD_INITQSPI_FlexSPI_D0_A_LABEL                  "FlexSPI_D0_A/U13[5]"   /*!< Label */
#define BOARD_INITQSPI_FlexSPI_D0_A_NAME                          "FlexSPI_D0_A"   /*!< Identifier name */

/* GPIO_SD_B1_10 (number 21), FlexSPI_D1_A/U13[2] */
#define BOARD_INITQSPI_FlexSPI_D1_A_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPI_FlexSPI_D1_A_SIGNAL                       FLEXSPI_A_DATA1   /*!< FLEXSPI signal: FLEXSPI_A_DATA1 */
#define BOARD_INITQSPI_FlexSPI_D1_A_PIN_NAME                       GPIO_SD_B1_10   /*!< Pin name */
#define BOARD_INITQSPI_FlexSPI_D1_A_LABEL                  "FlexSPI_D1_A/U13[2]"   /*!< Label */
#define BOARD_INITQSPI_FlexSPI_D1_A_NAME                          "FlexSPI_D1_A"   /*!< Identifier name */

/* GPIO_SD_B1_09 (number 22), FlexSPI_D2_A/U13[3] */
#define BOARD_INITQSPI_FlexSPI_D2_A_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPI_FlexSPI_D2_A_SIGNAL                       FLEXSPI_A_DATA2   /*!< FLEXSPI signal: FLEXSPI_A_DATA2 */
#define BOARD_INITQSPI_FlexSPI_D2_A_PIN_NAME                       GPIO_SD_B1_09   /*!< Pin name */
#define BOARD_INITQSPI_FlexSPI_D2_A_LABEL                  "FlexSPI_D2_A/U13[3]"   /*!< Label */
#define BOARD_INITQSPI_FlexSPI_D2_A_NAME                          "FlexSPI_D2_A"   /*!< Identifier name */

/* GPIO_SD_B1_06 (number 25), FlexSPI_D3_A/U13[7] */
#define BOARD_INITQSPI_FlexSPI_D3_A_PERIPHERAL                           FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPI_FlexSPI_D3_A_SIGNAL                       FLEXSPI_A_DATA3   /*!< FLEXSPI signal: FLEXSPI_A_DATA3 */
#define BOARD_INITQSPI_FlexSPI_D3_A_PIN_NAME                       GPIO_SD_B1_06   /*!< Pin name */
#define BOARD_INITQSPI_FlexSPI_D3_A_LABEL                  "FlexSPI_D3_A/U13[7]"   /*!< Label */
#define BOARD_INITQSPI_FlexSPI_D3_A_NAME                          "FlexSPI_D3_A"   /*!< Identifier name */

/* GPIO_SD_B1_11 (number 19), FlexSPI_SS0/U13[1] */
#define BOARD_INITQSPI_FlexSPI_SS0_PERIPHERAL                            FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPI_FlexSPI_SS0_SIGNAL                        FLEXSPI_A_SS0_B   /*!< FLEXSPI signal: FLEXSPI_A_SS0_B */
#define BOARD_INITQSPI_FlexSPI_SS0_PIN_NAME                        GPIO_SD_B1_11   /*!< Pin name */
#define BOARD_INITQSPI_FlexSPI_SS0_LABEL                    "FlexSPI_SS0/U13[1]"   /*!< Label */
#define BOARD_INITQSPI_FlexSPI_SS0_NAME                            "FlexSPI_SS0"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
